# Missing Data

In [1]:
import pandas as pd
import numpy as np

## Now, creating a DF from the Dict.

    Before this we were creating a DataFrame from the array or list ( a multileveled ).
    data = np.random.randint(1,100,(5,5))
    
      >>> data ->    [[  1  2  3  4  5 ],
                      [  6  7  8  9 10 ],
                      [ 11 12 13 14 15 ],
                      [ 16 17 18 19 20 ],
                      [ 21 22 23 24 25 ]]
                      
      >>> df = pd.DataFrame(data=data,index=[1,2,3,4,5],column=[a,b,c,d,e])
      
      
    But now, 
    To create a DF from the DICT, we will go in this way.
    
    Please recall from a Series Notebook, creating a Series from Dict ( See a Intelligent Section )
    • It is different than creating a Series as the series is only consists of single column. So it
      was easy there.
      
    • Now, we are creating a DataFrame which is made up of Series i.e not just 1-D.
    
#### Don't be confused... just follow up the following cells to understand what's going on.

In [36]:
dict_ = {'Col1': [1,2,3,4,np.nan],
         'Col2': [1,2,np.nan,np.nan,5],
         'Col3': [1,2,3,np.nan,5]}                                               # NEW! np.nan  <--- WOW!

df = pd.DataFrame(data=dict_)
df

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   NaN   3.0
3   4.0   NaN   NaN
4   NaN   5.0   5.0

#### SEE. You must not pass list of irregular lengths, otherwise it will throw an error.

Providing the Manual index WHEN passing a dict as main data will work.
### BUT DON't pass the Manual Column when you pass a Dict already!
(The cell below shows exactly what I mean)

In [13]:
dict_ = {'Col1': [1,2,3,4,np.nan],
         'Col2': [1,2,np.nan,4,5],
         'Col3': [1,2,3,np.nan,5]}

df = pd.DataFrame(data= dict_, index= list('abcde'), columns= list('abc'))
df

     a    b    c
a  NaN  NaN  NaN
b  NaN  NaN  NaN
c  NaN  NaN  NaN
d  NaN  NaN  NaN
e  NaN  NaN  NaN

###

## Droping the NaN valued Row / Col

In [17]:
df

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   NaN   3.0
3   4.0   NaN   NaN
4   NaN   5.0   5.0

In [27]:
df.dropna()

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0

    • By default df.dropna() drops rows. To drop cols use:
        >>>   axis= 1
        
    • And, to drop only those rows / cols with more than 'n' NaN, pass this:
        >>>   thresh= n
        
        Ex. By default it drops all rows / cols with having atleat one NaN.
            But I want to drop those rows / cols with more than 3 NaN.
            >>>   df.dropna(thresh= 3)

## Filling the NaN in DF

In [28]:
df

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   NaN   3.0
3   4.0   NaN   NaN
4   NaN   5.0   5.0

In [29]:
df.fillna('AAYUSH')

     Col1    Col2    Col3
0       1       1       1
1       2       2       2
2       3  AAYUSH       3
3       4  AAYUSH  AAYUSH
4  AAYUSH       5       5

#### Filling in perticular Row / Col

In [34]:
df.iloc[:,0].fillna('AAYUSH')

0         1
1         2
2         3
3         4
4    AAYUSH
Name: Col1, dtype: object

#### Do the same with your own sagment.


__
## Some logical Fills.

In [41]:
df

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   NaN   3.0
3   4.0   NaN   NaN
4   NaN   5.0   5.0

In [56]:
df.fillna(df.mean())                             # Takes the mean of each col and fills in.

   Col1      Col2  Col3
0   1.0  1.000000  1.00
1   2.0  2.000000  2.00
2   3.0  2.666667  3.00
3   4.0  2.666667  2.75
4   2.5  5.000000  5.00

In [57]:
df.mean(axis=1)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [60]:
df.mean(axis=0) #Same as df.mean()

Col1    2.500000
Col2    2.666667
Col3    2.750000
dtype: float64

###

###  DONE WITH LECTURE.
My practice...

In [61]:
df

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   NaN   3.0
3   4.0   NaN   NaN
4   NaN   5.0   5.0

In [72]:
df[:1].mean()

Col1    1.0
Col2    1.0
Col3    1.0
dtype: float64

In [82]:
df.fillna(method= 'ffill', axis= 1)

   Col1  Col2  Col3
0   1.0   1.0   1.0
1   2.0   2.0   2.0
2   3.0   3.0   3.0
3   4.0   4.0   4.0
4   NaN   5.0   5.0

#### Still not solved.

    I want to full the NaN values with the mean of Rows. Not by column.
    The tries I have done are not working.
    
# #Ask Grass